{
  "todos": [
    {
      "id": 1,
      "username": "user1",
      "todo": [
        {
          "id": 1,
          "title": "Programming",
          "desc": "Computer programming or coding is the composition of sequences of instructions, called programs, that computers can follow to perform tasks. It involves designing and implementing algorithms, step-by-step specifications of procedures, by writing code in one or more programming languages.",
          "completed": false
        },
        {
          "id": 2,
          "title": "University",
          "desc": "What is a university? A university is an institution of higher education, usually comprising a college of liberal arts and sciences and graduate and professional schools and having the authority to confer degrees in various fields of study.",
          "completed": true
        },
        {
          "id": 3,
          "title": "Sports",
          "desc": "Sport pertains to any form of physical activity or game,[1] often competitive and organized, that aims to use, maintain, or improve physical ability and skills while providing enjoyment to participants and, in some cases, entertainment to spectators. Sports can, through casual or organized participation, improve participants' physical health. Hundreds of sports exist, from those between single contestants, through to those with hundreds of simultaneous participants, either in teams or competing as individuals.",
          "completed": true
        },
        {
          "id": 4,
          "title": "Learning",
          "desc": "Learning is “a process that leads to change, which occurs as a result of experience and increases the potential for improved performance and future learning”. The change in the learner may happen at the level of knowledge, attitude or behavior.",
          "completed": false
        }
      ]
    },
    {
      "id": 2,
      "username": "user2",
      "todo": [
        {
          "id": 1,
          "title": "Project Report Completion",
          "desc": "Compile and summarize key findings, insights, and recommendations for the upcoming project report at work",
          "completed": false
        },
        {
          "id": 2,
          "title": "Grocery Shopping",
          "desc": "Create a list of essential items and head to the store to restock your pantry and fridge, ensuring you have everything you need.",
          "completed": false
        },
        {
          "id": 3,
          "title": "Exercise Routine",
          "desc": "Plan and execute a workout session to stay active and maintain a healthy lifestyle; consider incorporating a mix of cardio and strength exercises.",
          "completed": false
        },
        {
          "id": 4,
          "title": "Read Chapter of a Book",
          "desc": "Set aside dedicated time to read a chapter of a book, whether it's for personal development or leisure.",
          "completed": false
        }
      ]
    },
    {
      "id": 3,
      "username": "user3",
      "todo": [
        {
          "id": 1,
          "title": "Schedule Catch-up Call with a Friend",
          "desc": "Reach out to a friend you haven't spoken to in a while and schedule a time for a catch-up call to maintain social connections.",
          "completed": false
        },
        {
          "id": 2,
          "title": "Organize and Declutter",
          "desc": "Choose a specific area in your home or workspace to declutter and organize, creating a more efficient and pleasant environment.",
          "completed": true
        },
        {
          "id": 3,
          "title": "Learn Something New",
          "desc": "Dedicate time to learning a new skill, whether through online courses, tutorials, or books, to expand your knowledge and capabilities.",
          "completed": false
        },
        {
          "id": 4,
          "title": "Set Personal Goals",
          "desc": "Reflect on your short-term and long-term objectives, and outline actionable steps to work towards achieving your personal goals.",
          "completed": true
        }
      ]
    },
    {
      "id": 4,
      "username": "user4",
      "todo": [
        {
          "id": 1,
          "title": "Budget Review and Adjustment",
          "desc": "Take a detailed look at your finances, review expenses, and adjust your budget as needed to ensure financial stability and meet savings goals.",
          "completed": false
        },
        {
          "id": 2,
          "title": "Update Resume and LinkedIn Profile",
          "desc": "Spend some time updating your resume and LinkedIn profile with recent accomplishments, skills, and experiences to keep your professional image current.",
          "completed": false
        },
        {
          "id": 3,
          "title": "Plan a Relaxing Evening",
          "desc": "Schedule some self-care time by planning a relaxing evening—whether it's a bath, meditation, or your favorite hobby—to unwind and recharge.",
          "completed": true
        },
        {
          "id": 4,
          "title": "Digital Detox Time",
          "desc": "Designate a block of time to disconnect from screens and social media, allowing yourself a break to focus on offline activities and relaxation.",
          "completed": false
        }
      ]
    }
  ],
  "profiles": [
    {
      "id": 1,
      "username": "user1",
      "pass": "user1"
    },
    {
      "id": 2,
      "username": "user2",
      "pass": "user2"
    },
    {
      "id": 3,
      "username": "user3",
      "pass": "user3"
    },
    {
      "id": 4,
      "username": "user4",
      "pass": "user4"
    }
  ]
}
